# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=staging_gateway_api_endpoint]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 0s [id=staging_user-pool-id]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=3alc3vunja421djqnqu51qhnrk]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_4Gc6wl1Pzt2iYxjppuq9KoMXrjYA]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_CEPtq4FwBNpwK7iuFBK7qsccvPn9]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-staging.connectilly.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.random_password.nextauthsecret will be created
  + resource "random_password" "nextauthsecret" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 256
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-staging.connectilly.com",
          - "staging-web-seven.vercel.app",
          - "staging-web-connectilly.vercel.app",
          - "staging-web-mortezaalizadeh-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf" = "2661~9787174a80ee0feb660f3077bc4ceb0db0323ddc" -> "2960~824c1ee16f4638f9a8d06804bc61e72731a1f74f"
          ~ "../../../infrastructure/workspaces/common_resources/terraform.tf" = "196~f16581da91a7542df9da1e6459a3b35fa287f19e" -> "278~a530fc09a215668de7b7ad649af60c34cf085435"
          ~ "../../../infrastructure/workspaces/production/main.tf"            = "178~7eace298ad2e508d7d6164f67e04adb336052557" -> "198~fce602874a36f52b2c4509f1a4c36b9571c5253a"
          ~ "../../../infrastructure/workspaces/production/terraform.tf"       = "298~3c424748840f22ea31be202b6f063b48960d14c9" -> "380~2efb3c1937ea46c5e49867e23c3f45a37ab726c0"
          ~ "../../../infrastructure/workspaces/staging/main.tf"               = "175~e1c8b10e596d3a77b45f497c0bc7a915737608aa" -> "195~d092f578cf1abb43c5508c9c7ae24951210b102f"
          ~ "../../../infrastructure/workspaces/staging/terraform.tf"          = "295~778492669fd19f2fd08e3ca29f55a099cc198719" -> "377~86c808108a257e9f47d989d98e4f6b6706129106"
            # (27 unchanged elements hidden)
        }
      ~ id          = "dpl_CEPtq4FwBNpwK7iuFBK7qsccvPn9" -> (known after apply)
      ~ url         = "staging-2h10k6i2f-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_4Gc6wl1Pzt2iYxjppuq9KoMXrjYA"
        name                       = "staging-web"
      ~ serverless_function_region = "iad1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*